# Introduction

files needed = `industrial_production.xlsx`

This week we are working on

1. Working with DataFrames
2. Practice working with messy data
3. Looking through documentation

In [29]:
import pandas as pd

# Checking Documentation

- How to find solutions to your problems when writing code. 

- First place to start is by looking at the documentation for the function or package itself. Most well-developed packages will have some sort of explanation of the function or object, and proper ways to use it. 

- Check the [pandas documentation here](https://pandas.pydata.org/docs/). 

- Try searching for something like "dataframe" or ["melt"](https://pandas.pydata.org/docs/reference/api/pandas.melt.html?highlight=melt#pandas.melt).

- Python has [its own documentation](https://docs.python.org/3.7/library/).


- You can also check the documentation in Jupyter notebooks by using the `?` operator.

- For example, if you wanted to check the documentation for the `melt` function, you could type `?pd.melt` in a code cell and run it.

In [30]:
?pd.melt

Signature:
pd.melt(
    frame: 'DataFrame',
    id_vars=None,
    value_vars=None,
    var_name=None,
    value_name='value',
    col_level=None,
    ignore_index: 'bool' = True,
) -> 'DataFrame'
Docstring:
Unpivot a DataFrame from wide to long format, optionally leaving identifiers set.

This function is useful to massage a DataFrame into a format where one
or more columns are identifier variables (`id_vars`), while all other
columns, considered measured variables (`value_vars`), are "unpivoted" to
the row axis, leaving just two non-identifier columns, 'variable' and
'value'.

Parameters
----------
id_vars : tuple, list, or ndarray, optional
    Column(s) to use as identifier variables.
value_vars : tuple, list, or ndarray, optional
    Column(s) to unpivot. If not specified, uses all columns that
    are not set as `id_vars`.
var_name : scalar
    Name to use for the 'variable' column. If None it uses
    ``frame.columns.name`` or 'variable'.
value_name : scalar, default 'value'
    Name to use for the 'value' column.
col_level : int or str, optional
    If columns are a MultiIndex then use this level to melt.
ignore_index : bool, default True
    If True, original index is ignored. If False, the original index is retained.
    Index labels will be repeated as necessary.

    .. versionadded:: 1.1.0

Returns
-------
DataFrame
    Unpivoted DataFrame.

See Also
--------
DataFrame.melt : Identical method.
pivot_table : Create a spreadsheet-style pivot table as a DataFrame.
DataFrame.pivot : Return reshaped DataFrame organized
    by given index / column values.
DataFrame.explode : Explode a DataFrame from list-like
        columns to long format.

Notes
-----
Reference :ref:`the user guide <reshaping.melt>` for more examples.

Examples
--------
>>> df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
...                    'B': {0: 1, 1: 3, 2: 5},
...                    'C': {0: 2, 1: 4, 2: 6}})
>>> df
   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

>>> pd.melt(df, id_vars=['A'], value_vars=['B'])
   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

>>> pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])
   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

The names of 'variable' and 'value' columns can be customized:

>>> pd.melt(df, id_vars=['A'], value_vars=['B'],
...         var_name='myVarname', value_name='myValname')
   A myVarname  myValname
0  a         B          1
1  b         B          3
2  c         B          5

Original index values can be kept around:

>>> pd.melt(df, id_vars=['A'], value_vars=['B', 'C'], ignore_index=False)
   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
0  a        C      2
1  b        C      4
2  c        C      6

If you have multi-index columns:

>>> df.columns = [list('ABC'), list('DEF')]
>>> df
   A  B  C
   D  E  F
0  a  1  2
1  b  3  4
2  c  5  6

>>> pd.melt(df, col_level=0, id_vars=['A'], value_vars=['B'])
   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

>>> pd.melt(df, id_vars=[('A', 'D')], value_vars=[('B', 'E')])
  (A, D) variable_0 variable_1  value
0      a          B          E      1
1      b          B          E      3
2      c          B          E      5
File:      ~/opt/anaconda3/lib/python3.9/site-packages/pandas/core/reshape/melt.py
Type:      function

What if we get stuck? Here's where some "Google skills" come in handy. If you're not familiar with Google's hidden search operators, [check them out here](https://support.google.com/websearch/answer/2466433?hl=en), and some others [here](http://www.googleguide.com/advanced_operators_reference.html).

Try searching for terms related to the concepts you're struggling with- pandas functions, if/else statements, etc, rather than something specific to the problem you're trying to solve. A more general search will give you a higher probability of finding what you want. StackExchange has a number of answers that are well-organized for problems often encountered by everyone from beginners to experts.

When you find your answer, be sure to cite it, preferably with a link in your code, or alternatively, in a text file for your safekeeping.

## 1. Inspecting DataFrames

Describing and learning about a DataFrame is typically the first thing you do after defining it. We might want to know:

1. How big is this DataFrame?
2. What are the column or row names?
3. What are the data types? Are they the types we expected? 
4. How do we peek at small parts of the DataFrame?

Once we think our DataFrame is set up correctly, we can move on to the analysis.

### Loading and setting up your DataFrame

1. Load the file `industrial_production.xlsx` into a DataFrame. We want the sheet 'Quarterly'. 
2. Print out the first 4 rows and the last 4 rows of the DataFrame.
2. Set the index to 'DATE'.
3. Those variable names are terrible. Check out the 'README' tab in the excel workbook for the definitions. Rename the columns with sensible names.

In [31]:
# 1. Load the dataframe.
# 2. First four rows.
ind = pd.read_excel('industrial_production.xlsx', sheet_name='Quarterly')
ind.head(4)

,DATE,IPB51000SQ,IPB51100SQ,IPG211111CSQ,IPG21SQ,IPG2211A2SQ,IPG3361T3SQ,IPGMFSQ,IPN31152NQ,IPN3311A2RNQ
0,1919-01-01,NaN,NaN,NaN,22.7730,NaN,NaN,NaN,NaN,NaN
1,1919-04-01,NaN,NaN,NaN,23.4306,NaN,NaN,NaN,NaN,NaN
2,1919-07-01,NaN,NaN,NaN,25.8175,NaN,NaN,NaN,NaN,NaN
3,1919-10-01,NaN,NaN,NaN,24.0151,NaN,NaN,NaN,NaN,NaN

In [32]:
# 3. Set the index to 'DATE'.

ind.set_index('DATE', inplace = True)

ind.head(6)

,IPB51000SQ,IPB51100SQ,IPG211111CSQ,IPG21SQ,IPG2211A2SQ,IPG3361T3SQ,IPGMFSQ,IPN31152NQ,IPN3311A2RNQ
DATE,,,,,,,,,
1919-01-01,NaN,NaN,NaN,22.7730,NaN,NaN,NaN,NaN,NaN
1919-04-01,NaN,NaN,NaN,23.4306,NaN,NaN,NaN,NaN,NaN
1919-07-01,NaN,NaN,NaN,25.8175,NaN,NaN,NaN,NaN,NaN
1919-10-01,NaN,NaN,NaN,24.0151,NaN,NaN,NaN,NaN,NaN
1920-01-01,NaN,NaN,NaN,27.2301,NaN,NaN,NaN,NaN,NaN
1920-04-01,NaN,NaN,NaN,26.9622,NaN,NaN,NaN,NaN,NaN

### Changing column names

We need to change nine column names. This is a bit tedious, but at least we only have to do this once. Once written, we can reuse the code anytime we deal with this file. Below are three different ways to do it.

In [33]:
# 4. Change the column names (method 1). 

# This is the slick way. 
# Grab the column names from the index. 
# Make a list of the new column names.
# Zip them together (check the documentation for zip) and then create a dict. 
# The columns have to be in the correct order with respect to new_names.

old_names = ind.columns.to_list()
new_names = ['consumer', 'consumer durables', 'crude oil', 'mining', 'elec and gas', 'cars', 'manuf', 'ice cream', 'steel']
names = dict(zip(old_names, new_names))
ind = ind.rename(columns=names)

ind.head(2)

,consumer,consumer durables,crude oil,mining,elec and gas,cars,manuf,ice cream,steel
DATE,,,,,,,,,
1919-01-01,NaN,NaN,NaN,22.7730,NaN,NaN,NaN,NaN,NaN
1919-04-01,NaN,NaN,NaN,23.4306,NaN,NaN,NaN,NaN,NaN

Change the column names (method 2). 

If you know for sure that that the columns are in the correct order, you can also do this. In method 1, you can look at `names` and make sure the new and old names line up before changing the columns names. 

```python
new_names = ['consumer', 'consumer durables', 'crude oil', 'mining', 'elec and gas', 'cars', 'manuf', 'ice cream', 'steel']
ind.columns = new_names
```

Change the column names (method 3).

The most tedious, but robust way. No matter what order the columns are in, this will replace the names properly. 
```python
names = {'IPB51000SQ':'consumer',             'IPB51100SQ':'consumer durables', 'IPG211111CSQ':'crude oil','IPG21SQ':'mining', 'IPG2211A2SQ':'elec and gas', 'IPG3361T3SQ':'cars', 'IPGMFSQ':'manuf', 'IPN31152NQ':'ice cream', 'IPN3311A2RNQ':'steel'}
ind = ind.rename(columns=names)
```

### DataFrame attributes
Any object, including DataFrame, has attributes. We access attributes using the `.` operator. 


5. Try `dtypes`. What does it tell you?
6. Try `shape`. What is the return type? What does it tell you?
7. Try `columns`. What is the return type? What does it tell you?
8. Try `index`. What is the return type? What does it tell you?

In [34]:
# 5. dtypes

# Each column is made up of floats. (float64 is the same as float)
ind.dtypes

consumer             float64
consumer durables    float64
crude oil            float64
mining               float64
elec and gas         float64
cars                 float64
manuf                float64
ice cream            float64
steel                float64
dtype: object

In [35]:
# 6. shape

# This gives us the number of rows and columns in a tuple.
ind.shape

(404, 9)

In [36]:
#7. (column) index 

# An index object. The column names. 
ind.columns

Index(['consumer', 'consumer durables', 'crude oil', 'mining', 'elec and gas',
       'cars', 'manuf', 'ice cream', 'steel'],
      dtype='object')

In [37]:
# 8. (row) index 

# Another index object. A different type (a DatetimeIndex, to hold dates). 
ind.index

DatetimeIndex(['1919-01-01', '1919-04-01', '1919-07-01', '1919-10-01',
               '1920-01-01', '1920-04-01', '1920-07-01', '1920-10-01',
               '1921-01-01', '1921-04-01',
               ...
               '2017-07-01', '2017-10-01', '2018-01-01', '2018-04-01',
               '2018-07-01', '2018-10-01', '2019-01-01', '2019-04-01',
               '2019-07-01', '2019-10-01'],
              dtype='datetime64[ns]', name='DATE', length=404, freq=None)

### DataFrame methods
Objects also have methods. The following are methods of DataFrame. They also use the `.` to access, but are like functions. 

9. Try `sample(5)`. What does it tell you?
10. Try `describe()`. What does it tell you?

In [38]:
# 9. sample()

# A random sample of rows.
ind.sample(5)

,consumer,consumer durables,crude oil,mining,elec and gas,cars,manuf,ice cream,steel
DATE,,,,,,,,,
1927-01-01,NaN,NaN,NaN,37.0700,NaN,NaN,NaN,NaN,NaN
1962-07-01,37.7827,26.8168,NaN,70.6571,24.3315,NaN,NaN,NaN,NaN
1968-10-01,52.6996,42.9565,NaN,87.0493,37.5323,NaN,NaN,NaN,NaN
2003-01-01,108.6929,118.6496,88.2307,85.1881,96.9896,107.5023,93.6382,137.4338,91.8839
1936-04-01,NaN,NaN,NaN,33.0025,NaN,NaN,NaN,NaN,NaN

In [39]:
# 10. describe()

# Summary statistics. If a column is not made up of numbers, 
# it will not appear here. 
ind.describe()

,consumer,consumer durables,crude oil,mining,elec and gas,cars,manuf,ice cream,steel
count,324.000000,292.000000,192.000000,404.000000,324.000000,192.000000,192.000000,192.000000,192.000000
mean,65.047151,65.033777,115.684291,71.476008,54.800645,79.146544,74.033846,109.750889,104.150758
std,32.738490,36.161831,25.731753,27.447983,35.141579,28.333690,24.334594,26.297457,23.704066
min,12.149600,14.197100,73.701500,17.560800,3.421900,32.428100,36.094600,63.286800,57.771000
25%,33.051625,35.750100,90.038175,45.412000,19.624250,54.963425,49.640475,91.246650,90.773525
50%,66.471100,57.756800,117.488500,84.690050,56.409250,78.134450,72.335600,105.492500,98.896600
75%,100.139600,100.364475,133.501100,91.499200,89.436600,105.321125,98.524600,126.651475,105.842975
max,113.684700,124.179300,194.487800,133.493200,107.675900,132.507800,108.265900,179.319100,182.248200

## 2. Working with messy data: Pisa Scores

The [pisa](https://www.oecd.org/pisa/) test is a test given to 15-year olds around the world. It evaluates reading, math, and science skills. 

1. In a web browser, go to [dx.doi.org/10.1787/888932937035](http://dx.doi.org/10.1787/888932937035) This should initiate a download of an excel file with pisa scores across countries. Open the workbook up and take a look. This is a bit of a mess.

The issue here is that the workbook was formatted for humans to read. Since it is not a neat rectangular block of data, we will need to 'wrangle' it into shape. This is a common task in the real world, so let's practice some more.

In [40]:
# 2. Reading from the internet.

url = 'http://dx.doi.org/10.1787/888932937035'
pisa = pd.read_excel(url,
                     skiprows=18,             # skip the first 18 rows
                     skipfooter=7,            # skip the last 7
                     usecols=[0,1,9,13],      # select columns of interest
                     )

# Rather than use the 'usecols' argument, you could have loaded all the columns and dropped the ones you do not want.
# Notice that the first row is a bunch of text. That will cause some problems later...

pisa.head()

,Unnamed: 0,Mathematics,Reading,Science
0,NaN,Mean score in PISA 2012,Mean score in PISA 2012,Mean score in PISA 2012
1,NaN,NaN,NaN,NaN
2,OECD average,494.046447,496.462864,501.159793
3,NaN,NaN,NaN,NaN
4,Shanghai-China,612.675536,569.588408,580.117831

In [41]:
pisa = pisa.rename(columns = {"Unnamed: 0" : "Country"})

pisa.head(4)

,Country,Mathematics,Reading,Science
0,NaN,Mean score in PISA 2012,Mean score in PISA 2012,Mean score in PISA 2012
1,NaN,NaN,NaN,NaN
2,OECD average,494.046447,496.462864,501.159793
3,NaN,NaN,NaN,NaN

3. Look up `dropna()` in the pandas documentation.  
    1. Clean up your DataFrame. Drop any rows that have *at least one* `NaN`. Save the result into a new DataFrame named `pisa2`.

   How many rows are in `pisa2`?

In [42]:
# 3. Drop NaNs.
pisa2 = pisa.dropna()

pisa2.head()

           Country Mathematics      Reading     Science
2     OECD average     494.046447  496.462864  501.159793
4   Shanghai-China     612.675536  569.588408  580.117831
5        Singapore     573.468314  542.215834  551.493157
6  Hong Kong-China     561.241096  544.600086  554.937434
7   Chinese Taipei     559.824796  523.118904  523.314904

4. Using `pisa2`, make the country names the index.

In [43]:
# 4. Set the index.
pisa2 = pisa2.set_index("Country")

pisa2.sample(10)

                Mathematics      Reading     Science
Country
Turkey              447.984415  475.491466  463.412909
Costa Rica          406.999867  440.547811  429.350968
United Kingdom      493.934231  499.323115  514.129321
Latvia              490.571021  488.694414  502.186192
Germany             513.525056   507.67653  524.120799
OECD average        494.046447  496.462864  501.159793
Norway               489.37307  503.936686  494.523935
Hungary             477.044455  488.461334  494.302351
Hong Kong-China     561.241096  544.600086  554.937434
Tunisia              387.82463  404.078467  398.046451

5. Using `pisa2`, print out the ratios of the United States pisa scores (math, reading, science) relative to the OECD average.

In [54]:
# 5. US relative to the average. 
# The US is pretty average...

usa_vs_oecd = pisa2.loc['United States'] / pisa2.loc['OECD average']

print(f"The US ratios relative to the OECD average are:\n Mathematics: {usa_vs_oecd.iloc[0]:.3f}\n Reading: {usa_vs_oecd.iloc[1]:.3f}\n Science: {usa_vs_oecd.iloc[2]:.3f}")

The US ratios relative to the OECD average are:
 Mathematics: 0.974
 Reading: 1.002
 Science: 0.993

6. **Challenging.** Use `pisa2`. How correlated are the math, reading, and science scores with each other?  Write the correlation matrix to a file called 'pisa_corrs.xlsx'.

    This is a challenging question because, depending on how you read in the data, your columns are probably of type 'Object' (strings, basically) and `.corr()` won't work. Take a look at the first row of `pisa` to see why the data are stored as strings. Google around and see if you can convert the three columns to numbers. Then find the correlations.

In [59]:
# 6. Convert types/compute correlations
# Strings! 
pisa2 = pisa2.astype(float)
pisa2.dtypes

Mathematics       float64
Reading           float64
Science           float64
dtype: object

In [60]:
# New column names
pisa2.columns = ['math', 'read', 'sci']

In [62]:
# Now we are in good shape. What does .corr() do?
# What is the return type of .corr()?

pisa_corrs = pisa2.corr()
print(pisa_corrs)
print(type(pisa_corrs))

# Now save the DataFrame of results to a file. 
pisa_corrs.to_csv('pisa_corrs.csv')

          math      read       sci
math  1.000000  0.959806  0.972131
read  0.959806  1.000000  0.978559
sci   0.972131  0.978559  1.000000
<class 'pandas.core.frame.DataFrame'>